In [1]:
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

# File to Load (Remember to change these)
city_data_to_load = "data/city_data.csv"
ride_data_to_load = "data/ride_data.csv"

# Read the City and Ride Data
city_df=pd.read_csv(city_data_to_load)
ride_df=pd.read_csv(ride_data_to_load)
# Combine the data into a single dataset
combine_df=pd.merge(ride_df,city_df, on='city')
# Display the data table for preview
combine_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2018-01-14 10:14:22,13.83,5739410935873,5,Urban
1,Lake Jonathanshire,2018-04-07 20:51:11,31.25,4441251834598,5,Urban
2,Lake Jonathanshire,2018-03-09 23:45:55,19.89,2389495660448,5,Urban
3,Lake Jonathanshire,2018-04-07 18:09:21,24.28,7796805191168,5,Urban
4,Lake Jonathanshire,2018-01-02 14:14:50,13.89,424254840012,5,Urban

In [21]:
double_groupby=combine_df.groupby(['city','type'])

In [29]:
double_count=double_groupby.count()

In [32]:
double_count.groupby('type').count()

          date  fare  ride_id  driver_count
type
Rural       18    18       18            18
Suburban    36    36       36            36
Urban       66    66       66            66

In [26]:
'double_groupby.loc['Urban']

SyntaxError: invalid syntax (<ipython-input-26-a31dea6395b1>, line 1)